wujique/stm32f407/board_dev/dev_lcd.c
/**
 * @file            dev_lcd.c
 * @brief           LCD 中间层
 * @author          wujique
 * @date            2018年4月17日 星期二
 * @version         初稿
 * @par             版权所有 (C), 2013-2023
 * @par History:
 * 1.日    期:        2018年4月17日 星期二
 *   作    者:         wujique
 *   修改内容:   创建文件
 		1 源码归屋脊雀工作室所有。
		2 可以用于的其他商业用途（配套开发板销售除外），不须授权。
		3 屋脊雀工作室不对代码功能做任何保证，请使用者自行测试，后果自负。
		4 可随意修改源码并分发，但不可直接销售本代码获利，并且请保留WUJIQUE版权说明。
		5 如发现BUG或有优化，欢迎发布更新。请联系：code@wujique.com
		6 使用本源码则相当于认同本版权说明。
		7 如侵犯你的权利，请联系：code@wujique.com
		8 一切解释权归屋脊雀工作室所有。
*/
#include <stdarg.h>
#include <stdio.h>
#include "string.h"
#include "stm32f4xx.h"
#include "wujique_log.h"
#include "list.h"
#include "dev_lcdbus.h"
#include "dev_lcd.h"
#include "dev_ILI9341.h"
#include "dev_str7565.h"
#include "alloc.h"

#define DEV_LCD_DEBUG

#ifdef DEV_LCD_DEBUG
#define LCD_DEBUG	wjq_log 
#else
#define LCD_DEBUG(a, ...)
#endif

s32 LcdMagNum = 95862;

u16 PenColor = BLACK;
u16 BackColor = BLUE;



/*
	各种LCD的规格参数
*/
_lcd_pra LCD_IIL9341 ={
		.id	  = 0x9341,
		.width = 240,	//LCD 宽度
		.height = 320,	//LCD 高度
};
		
/*SPI接口的lcd ,驱动芯片也是9341，改名9342*/
_lcd_pra LCD_IIL9342 ={
		.id	  = 0x9342,
		.width = 240,	//LCD 宽度
		.height = 320,	//LCD 高度
};		
_lcd_pra LCD_IIL9325 ={
		.id   = 0x9325,
		.width = 240,	//LCD 宽度
		.height = 320, //LCD 高度
};

_lcd_pra LCD_R61408 ={
		.id   = 0x1408,//
		.width = 480,	//LCD 宽度
		.height = 800, //LCD 高度
};


_lcd_pra LCD_Cog12864 ={
		.id   = 0x7565,//
		.width = 64,	//LCD 宽度
		.height = 128, //LCD 高度
};
		
_lcd_pra LCD_Cog12832 ={
		.id   = 0x7564,//
		.width = 32,	//LCD 宽度
		.height = 128, //LCD 高度
};		
		
_lcd_pra LCD_Oled12864 ={
		.id   = 0x1315,//
		.width = 64,	//LCD 宽度
		.height = 128, //LCD 高度
};

/*
	各种LCD列表
*/
_lcd_pra *LcdPraList[6]=
			{
				&LCD_IIL9341,		
				&LCD_IIL9325,
				&LCD_R61408,
				&LCD_Cog12864,
				&LCD_Oled12864,
				&LCD_IIL9342,
};

/*
	所有驱动列表
*/
_lcd_drv *LcdDrvList[] = {
					&TftLcdILI9341Drv,
					&TftLcdILI9325Drv,
					&CogLcdST7565Drv,
					&OledLcdSSD1615rv,
					&TftLcdILI9341_8_Drv,
};
/*

	可自动识别ID的驱动

*/
_lcd_drv *LcdProbDrv8080List[] = {
					&TftLcdILI9341Drv,
					&TftLcdILI9325Drv,
};

/**
 *@brief:      dev_lcd_findpra
 *@details:    根据ID查找LCD参数
 *@param[in]   u16 id  
 *@param[out]  无
 *@retval:     _lcd_pra
 */
static _lcd_pra *dev_lcd_findpra(u16 id)
{
	u8 i =0;
	
	while(1)
	{
		if(LcdPraList[i]->id == id)
		{
			return LcdPraList[i];
		}
		i++;
		if(i>= sizeof(LcdPraList)/sizeof(_lcd_pra *))
		{
			return NULL;
		}
	}
	
}
/**
 *@brief:      dev_lcd_finddrv
 *@details:    根据ID查找设备驱动
 *@param[in]   u16 id  
 *@param[out]  无
 *@retval:     _lcd_drv
 */
static _lcd_drv *dev_lcd_finddrv(u16 id)
{
	u8 i =0;
	
	while(1)
	{
		if(LcdDrvList[i]->id == id)
		{
			return LcdDrvList[i];
		}
		i++;
		if(i>= sizeof(LcdDrvList)/sizeof(_lcd_drv *))
		{
			return NULL;
		}
	}
}

/**
 *@brief:      dev_lcd_setdir
 *@details:    设置横屏或竖屏，扫描方向
 *@param[in]   u8 dir       0 竖屏1横屏
               u8 scan_dir  参考宏定义L2R_U2D       
 *@param[out]  无
 *@retval:     
 */
s32 dev_lcd_setdir(DevLcdNode *node, u8 dir, u8 scan_dir)
{
	u16 temp;
	u8 scan_dir_tmp;

	if(node == NULL)
		return -1;

	
	if(dir != node->dir)//切换屏幕方向	
	{
		
		node->dir = node->dir^0x01;
		temp = node->width;
		node->width = node->height;
		node->height = temp;
		LCD_DEBUG(LOG_DEBUG, "set dir w:%d, h:%d\r\n", node->width, node->height);
	}
	
	
	if(node->dir == W_LCD)//横屏，扫描方向映射转换
	{
		/*
			横屏	 竖屏
			LR----UD
			RL----DU
			UD----RL
			DU----LR
			UDLR----LRUD
		*/
		scan_dir_tmp = 0;
		if((scan_dir&LRUD_BIT_MASK) == 0)
		{
			scan_dir_tmp += LRUD_BIT_MASK;
		}

		if((scan_dir&LR_BIT_MASK) == LR_BIT_MASK)
		{
			scan_dir_tmp += UD_BIT_MASK;	
		}

		if((scan_dir&UD_BIT_MASK) == 0)
		{
			scan_dir_tmp += LR_BIT_MASK;
		}
	}
	else
	{
		scan_dir_tmp = scan_dir;
	}
	
	node->scandir = scan_dir_tmp;
	
	node->drv->set_dir(node, node->scandir);
	
	return 0;
}

struct list_head DevLcdRoot = {&DevLcdRoot, &DevLcdRoot};	

s32 dev_lcd_register(const DevLcd *dev)
{
	struct list_head *listp;
	DevLcdNode *plcdnode;
	s32 ret = -1;
	
	wjq_log(LOG_INFO, "[register] lcd :%s, base on:%s!\r\n", dev->name, dev->buslcd);

	/*
		先要查询当前，防止重名
	*/
	listp = DevLcdRoot.next;
	while(1)
	{
		if(listp == &DevLcdRoot)
			break;

		plcdnode = list_entry(listp, DevLcdNode, list);

		if(strcmp(dev->name, plcdnode->dev.name) == 0)
		{
			wjq_log(LOG_INFO, "lcd dev name err!\r\n");
			return -1;
		}

		if(strcmp(dev->buslcd, plcdnode->dev.buslcd) == 0)
		{
			wjq_log(LOG_INFO, "one lcd bus just for one lcd!\r\n");
			return -1;
		}
		
		listp = listp->next;
	}

	/* 
		申请一个节点空间 
		
	*/
	plcdnode = (DevLcdNode *)wjq_malloc(sizeof(DevLcdNode));
	list_add(&(plcdnode->list), &DevLcdRoot);
	/*复制设备信息*/
	memcpy((u8 *)&plcdnode->dev, (u8 *)dev, sizeof(DevLcd));
	plcdnode->gd = -1;

	/*初始化*/
	if(dev->id == NULL)
	{
		LCD_DEBUG(LOG_DEBUG, "prob LCD id\r\n");

		/*找到驱动跟规格后，初始化*/
		u8 j = 0;

		while(1)
		{
			ret = LcdProbDrv8080List[j]->init(plcdnode);
			if(ret == 0)
			{
				LCD_DEBUG(LOG_DEBUG, "lcd drv prob ok!\r\n");	
				plcdnode->drv = LcdProbDrv8080List[j];
				/*
					用驱动的ID找参数
				*/
				plcdnode->pra = dev_lcd_findpra(plcdnode->drv->id);
				break;
			}	
			else
			{
				j++;
				if(j >= sizeof(LcdProbDrv8080List)/sizeof(_lcd_drv *))
				{
					LCD_DEBUG(LOG_DEBUG, "lcd prob err\r\n");
					break;
				}
			}
		}

	}
	else
	{
		ret = -1;
		
		plcdnode->drv = dev_lcd_finddrv(dev->id);
		if(plcdnode->drv != NULL)
		{
			
			plcdnode->pra = dev_lcd_findpra(dev->id);
			if(plcdnode->pra != NULL)
			{
				/*找到驱动跟规格后，初始化*/
				ret = plcdnode->drv->init(plcdnode);
			}
			else
				LCD_DEBUG(LOG_DEBUG, "lcd find pra fail!\r\n");
		}
		else
		{
			
			LCD_DEBUG(LOG_DEBUG, "lcd find drv fail!\r\n");
		}
	}

	if(ret == 0)
	{
		plcdnode->gd = -1;
		
