wujique/stm32f407/board_dev/dev_lcd.c
	if(lcd == NULL)
		return;	
	
    put_string (lcd, x - (sl / 2) * font_vga_8x8.width,
                y - font_vga_8x8.height / 2, s, colidx);
}

/**
 *@brief:      rect
 *@details:    画一个矩形框
 *@param[in]   int x1           
               int y1           
               int x2           
               int y2           
               unsigned colidx  
 *@param[out]  无
 *@retval:     
 */
void rect (DevLcdNode *lcd, int x1, int y1, int x2, int y2, unsigned colidx)
{
	if(lcd == NULL)
		return;

	line (lcd, x1, y1, x2, y1, colidx);
	line (lcd, x2, y1, x2, y2, colidx);
	line (lcd, x2, y2, x1, y2, colidx);
	line (lcd, x1, y2, x1, y1, colidx);
}

/**
 *@brief:      dev_lcd_put_string
 *@details:    显示字符串，支持中文
 *@param[in]   无
 *@param[out]  无
 *@retval:     	
 */
s32 dev_lcd_put_string(DevLcdNode *lcd, FontType font, int x, int y, char *s, unsigned colidx)
{
	u16 slen;
	u16 xlen,ylen;
	u16 *framebuff;//样点缓冲，按照L2R_U2D格式填充
	u8 *dotbuf;//字符点阵缓冲
	s32 res;
	u16 sidx;
	u8 i,j;
	u32 xbase;

	if(lcd == NULL)
		return -1;
	
	/* 通过刷一整块，提高显示速度 */
	slen = strlen(s);
	//uart_printf("str len:%d\r\n", slen);

	/*
		根据字符串长度计算刷新区域长宽
	*/
	xlen = slen*FontAscList[font]->width;
	ylen = FontAscList[font]->height;

	framebuff = (u16*)wjq_malloc(xlen*ylen*sizeof(u16));//样点缓冲
	dotbuf = (u8*)wjq_malloc(32);//要改为根据字库类型申请
	sidx = 0;

	/*获取点阵，并转化为LCD像素*/
	while(1)
	{
		if(*(s+sidx) < 0x81)//英文字母
		{
			//uart_printf("eng\r\n");
			u8 ch;
			/*获取点阵*/
			ch = *(s+sidx);
			
			res = font_get_asc(font, &ch, dotbuf);
			//PrintFormat(dotbuf, 16);
			/*asc是横库*/

			for(j=0;j<FontAscList[font]->height;j++)
			{

				xbase = xlen*j + sidx*FontAscList[font]->width;//当前字符X轴偏移量
				for(i=0;i<FontAscList[font]->width;i++)
				{
					/*暂时只处理6*12，8*16的ASC，每一列1个字节*/
					if((dotbuf[j*1+i/8]&(0x80>>(i%8)))!= 0)
					{
						//uart_printf("* ");
						framebuff[xbase + i] = colidx;
					}
					else
					{
						//uart_printf("- ");
						framebuff[xbase + i] = BackColor;
					}
				}
				//uart_printf("\r\n");
			}	
			
			sidx++;
		}
		else//汉字
		{
			//uart_printf("ch\r\n");
			res = font_get_hz(font, s+sidx, dotbuf);//从SD卡读取一个1616汉字的点阵要1ms
			//PrintFormat(dotbuf, 32);

			/*仅仅支持纵库，取模方式2,16*16*/
			for(j=0; j<FontList[font]->height; j++)
			{
				xbase = xlen*j + sidx*FontAscList[font]->width;//当前字符X轴偏移量
				for(i=0;i<FontList[font]->width;i++)
				{
					/*暂时只做1212，1616，每一列2个字节数据*/
					if((dotbuf[i*2+j/8]&(0x80>>(j%8)))!= 0)
					{
						//uart_printf("* ");
						framebuff[xbase + i] = colidx;
					}
					else
					{
						//uart_printf("- ");
						framebuff[xbase + i] = BackColor;
					}
				}
				//uart_printf("\r\n");
			}	
			
			sidx+= 2;
		}

		if(sidx >= slen)
		{
			//uart_printf("finish");
			break;
		}
	}
	

	dev_lcd_fill(lcd, x, x + xlen-1, y, y + ylen-1, framebuff);

	wjq_free(framebuff);
	wjq_free(dotbuf);

	return 0;	
}
extern void Delay(__IO uint32_t nTime);

#if 1
typedef struct tagBITMAPFILEHEADER  //文件头  14B  
{ 
    u16  bfType;   //0x424d, "BM"
    u32  bfSize;   //文件大小，包含文件头
    u16  bfReserved1;   //保留字节
    u16  bfReserved2;   //保留字节
    u32  bfOffBits;   	//从文件头到实际位图数据的偏移
} BITMAPFILEHEADER; 

typedef struct tagBITMAPINFOHEADER  //位图信息头
{ 
    u32 biSize;   //本结构长度，也即是40
    s32 biWidth;  //图像宽度   
    s32 biHeight; //图像高度    
    u16 biPlanes; //1  
    u16 biBitCount;//1黑白二色图，4 16位色，8 256色，24 真彩色 
    u32 biCompression;   //是否压缩
    u32 biSizeImage;   //实际位图数据字节数
    s32 biXPelsPerMeter;  //目标设备水平分辨率 
    s32 biYPelsPerMeter;   //目标设备垂直分辨率
    u32 biClrUsed;  //图像实际用到颜色数，如为0，则用到的颜色数为2的biBitCount次方
    u32 biClrImportant;  //指定本图象中重要的颜色数，如果该值为零，则认为所有的颜色都是重要的
} BITMAPINFOHEADER;

/*调色板每个元素*/
typedef struct tagRGBQUAD
{ 
	u8    rgbBlue; //蓝色分量  
	u8    rgbGreen; //绿色分量    
	u8    rgbRed;   //红色分量  
	u8    rgbReserved;    
} RGBQUAD; 

#include "ff.h"

#define WIDTHBYTES(i) ((i+31)/32*4)

/*

	4种图片，刷屏时间

			FSMC	SPI（其中，将U16拆为U8，花10ms）
	1bit	53ms	316
	4bit	74		340
	8bit	79		344
	24bit	111		378


*/
s32 dev_lcd_show_bmp(DevLcdNode *lcd, u16 x, u16 y, u16 xlen, u16 ylen, s8 *BmpFileName)
{
	BITMAPFILEHEADER    bf;
    BITMAPINFOHEADER    bi;
	
	FRESULT res;
	FIL bmpfile;
	
	u32 rlen;
    u16 LineBytes;
	u16 NumColors;
    u32 ImgSize;
	u16 buf[40];

	u32 i,j;
	u8 *palatte;
	volatile u16 color;
	u32 k, m;
	u16 r,g,b;
	u8 c;
	u16 *pcc;
	u8 *pdata;
	u8 linecnt = 20;//一次读多行，加快速度
	u8 l;
	
	wjq_log(LOG_DEBUG, "bmp open file:%s\r\n", BmpFileName);
	
	res = f_open(&bmpfile, BmpFileName, FA_READ);
	if(res != FR_OK)
	{
		wjq_log(LOG_DEBUG, "bmp open file err:%d\r\n", res);
		return -1;
	}

    res = f_read(&bmpfile, (void *)buf, 14, &rlen);

	bf.bfType      = buf[0];
    bf.bfSize      = buf[2];
    bf.bfSize = (bf.bfSize<<16)+buf[1];
    bf.bfReserved1 = buf[3];
    bf.bfReserved2 = buf[4];
    bf.bfOffBits   = buf[6];
    bf.bfOffBits = (bf.bfOffBits<<16)+buf[5];
	
	wjq_log(LOG_DEBUG, "bf.bfType:%x\r\n", bf.bfType);	
	wjq_log(LOG_DEBUG, "bf.bfSize:%d\r\n", bf.bfSize);
	wjq_log(LOG_DEBUG, "bf.bfOffBits:%d\r\n", bf.bfOffBits);

	res = f_read(&bmpfile, (void *)buf, 40, &rlen);

	bi.biSize           = (unsigned long) buf[0];
    bi.biWidth          = (long) buf[2];
    bi.biHeight         = (long) buf[4];
    bi.biPlanes         = buf[6];
    bi.biBitCount       = buf[7];
    bi.biCompression    = (unsigned long) buf[8];
    bi.biSizeImage      = (unsigned long) buf[10];
    bi.biXPelsPerMeter  = (long) buf[12];
    bi.biYPelsPerMeter  = (long) buf[14];
    bi.biClrUsed        = (unsigned long) buf[16];
    bi.biClrImportant   = (unsigned long) buf[18];

	wjq_log(LOG_DEBUG, "bi.biSize:%d\r\n", bi.biSize);	
	wjq_log(LOG_DEBUG, "bi.biWidth:%d\r\n", bi.biWidth);
	wjq_log(LOG_DEBUG, "bi.biHeight:%d\r\n", bi.biHeight);
	wjq_log(LOG_DEBUG, "bi.biPlanes:%d\r\n", bi.biPlanes);
	wjq_log(LOG_DEBUG, "bi.biBitCount:%d\r\n", bi.biBitCount);
	wjq_log(LOG_DEBUG, "bi.biCompression:%d\r\n", bi.biCompression);
	wjq_log(LOG_DEBUG, "bi.biSizeImage:%d\r\n", bi.biSizeImage);
	wjq_log(LOG_DEBUG, "bi.biXPelsPerMeter:%d\r\n", bi.biXPelsPerMeter);
	wjq_log(LOG_DEBUG, "bi.biYPelsPerMeter:%d\r\n", bi.biYPelsPerMeter);
	wjq_log(LOG_DEBUG, "bi.biClrUsed:%d\r\n", bi.biClrUsed);
	wjq_log(LOG_DEBUG, "bi.biClrImportant:%d\r\n", bi.biClrImportant);

	/*8个像素占用一个字节，不足一个字节补足一个字节*/
	/*单色图片四字节对齐*/
	LineBytes = WIDTHBYTES(bi.biWidth * bi.biBitCount);
    ImgSize   = (unsigned long) LineBytes  * bi.biHeight;

    wjq_log(LOG_DEBUG, "bmp w:%d,h:%d, bitcount:%d, linebytes:%d\r\n", bi.biWidth, bi.biHeight, bi.biBitCount, LineBytes);
	
	if(bi.biClrUsed!=0)
		NumColors=(DWORD)bi.biClrUsed;//如果 bi.biClrUsed 不为零，就是本图象实际用到的颜色
	else
	{
	    switch(bi.biBitCount)
	    {
	    case 1:
	        NumColors=2;//黑白屏用到两个调色板，一个是黑一个是白
	        break;
	        
	    case 4:
	        NumColors=16;
	        break;
	        
	    case 8:
	        NumColors=256;
	        break;
	        
	    case 24:
	        NumColors=0;
	        break;
	        
	    default:
	        f_close(&bmpfile);
	        return 2;
	    }
	}

