wujique/stm32f407/board_dev/dev_lcd.c
	/* 读调色板 */
	if(NumColors != 0)
	{
		palatte = wjq_malloc(4*NumColors);
		f_read(&bmpfile, (void *)palatte, 4*NumColors, &rlen);
	}

	if(xlen > bi.biWidth)
        xlen = bi.biWidth;

    if(ylen > bi.biHeight)
        ylen = bi.biHeight;

	pdata = wjq_malloc(LineBytes*linecnt);
	
	dev_lcd_prepare_display(lcd, x, x+xlen-1, y, y+ylen-1);
			
    switch(bi.biBitCount)
    {
    case 1:
		GPIO_ResetBits(GPIOG, GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_2| GPIO_Pin_3);
		
		pcc = wjq_malloc(xlen*sizeof(u16));
	
		for(j=0; j<ylen;) //图片取模:横向,左高右低
        {
			f_read(&bmpfile, (void *)pdata, LineBytes*linecnt, &rlen);
			if(rlen != LineBytes*linecnt)
			{
				wjq_log(LOG_DEBUG, "bmp read data err!\r\n");
			}
			l = 0;
			while(l < linecnt)
			{
				k = l*LineBytes;
				#if 0//不用除法， 测试
				i = 0;				
				while(1)
	            {
					/*
            		一个字节8个像素，高位在前
            		调色板有256种颜色
					*/
		            c = pdata[k];
					
					m = 0;
					while(m <8)
					{
						if((c &(0x80>>m)) != 0)
	                		*(pcc+i)  = WHITE;
						else
							*(pcc+i)  = BLACK;	

						i++;
						if(i>= xlen)
							break;
						m++;
					}
					
					if(i>= xlen)
						break;

					k++;
	            }
				#else
				for(i=0; i<xlen; i++)
		        {
		        	/*
		        		一个字节8个像素，高位在前
		        		调色板有256种颜色
					*/
		            c = pdata[k+(i/8)]&(0x80>>(i%8));
		            
		            if(c != 0)
						*(pcc+i) = WHITE;
		            else
						*(pcc+i) = BLACK;
		        }
				#endif
				
				lcd->drv->flush(lcd, pcc, xlen);
				l++;
			}

			j += linecnt;
        }
		wjq_free(pcc);
		GPIO_SetBits(GPIOG, GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_2| GPIO_Pin_3);
        break;
        
    case 4:
		GPIO_ResetBits(GPIOG, GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_2| GPIO_Pin_3);
		pcc = wjq_malloc(xlen*sizeof(u16));
	
		for(j=0; j<ylen;) //图片取模:横向,左高右低
        {
			f_read(&bmpfile, (void *)pdata, LineBytes*linecnt, &rlen);
			if(rlen != LineBytes*linecnt)
			{
				wjq_log(LOG_DEBUG, "bmp read data err!\r\n");
			}
			l = 0;
			while(l < linecnt)
			{
				k = l*LineBytes;

				#if 0//不用除法,测试
				i = 0;
				while(1)
	            {
					/*4个bit 1个像素，要进行对U16的转换
					rgb565
					#define BLUE         	 0x001F  
					#define GREEN         	 0x07E0
					#define RED           	 0xF800
					*/
					c = *(pdata+k);
					
					m = ((c>>4)&0x0f)*4;
					
					b = (palatte[m++] & 0xF8)>>3;
					g = (palatte[m++] & 0xFC)>>2;
					r = (palatte[m] & 0xF8)>>3;
	                                
	                *(pcc+i) = (r<<11)|(g<<5)|(b<<0);
					
					i++;
					if(i>= xlen)
						break;
					
					m = (c&0x0f)*4;
					
					b = (palatte[m++] & 0xF8)>>3;
					g = (palatte[m++] & 0xFC)>>2;
					r = (palatte[m] & 0xF8)>>3;

	                *(pcc+i) = (r<<11)|(g<<5)|(b<<0);
					
					i++;
					if(i>= xlen)
						break;
					k++;
	            }
				#else
				for(i=0; i < xlen; i++)
				{
									/*4个bit 1个像素，要进行对U16的转换
					rgb565
	#define BLUE			 0x001F  
	#define GREEN			 0x07E0
	#define RED 			 0xF800
					*/
					m = *(pdata+k+i/2);
					
					if(i%2 == 0)
						m = ((m>>4)&0x0f);
					else
						m = (m&0x0f);
					m = m*4;
					
					r = (palatte[m+2] & 0xF8)>>3;
					g = (palatte[m+1] & 0xFC)>>2;
					b = (palatte[m] & 0xF8)>>3;
					
					*(pcc+i) = (r<<11)|(g<<5)|(b<<0);
				}
				#endif
				
				lcd->drv->flush(lcd, pcc, xlen);
				l++;
			}

			j += linecnt;
        }
		wjq_free(pcc);
		GPIO_SetBits(GPIOG, GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_2| GPIO_Pin_3);
        break;

    case 8:
		GPIO_ResetBits(GPIOG, GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_2| GPIO_Pin_3);
		pcc = wjq_malloc(xlen*sizeof(u16));	
		for(j=0; j<ylen;) //图片取模:横向,左高右低
        {
			f_read(&bmpfile, (void *)pdata, LineBytes*linecnt, &rlen);
			if(rlen != LineBytes*linecnt)
			{
				wjq_log(LOG_DEBUG, "bmp read data err!\r\n");
			}
			
			l = 0;
			while(l < linecnt)
			{
				k = l*LineBytes;
				
            	for(i=0; i < xlen; i++)
	            {
					/*1个字节1个像素，要进行对U16的转换
					rgb565
					#define BLUE         	 0x001F  
					#define GREEN         	 0x07E0
					#define RED           	 0xF800
					*/
					m = *(pdata+k);
					k++;
					m = m*4;
					
					r = (palatte[m+2] & 0xF8)>>3;
	                g = (palatte[m+1] & 0xFC)>>2;
	                b = (palatte[m] & 0xF8)>>3;
					
	                *(pcc+i)  = (r<<11)|(g<<5)|(b<<0);
	            }
				
				lcd->drv->flush(lcd, pcc, xlen);
				
				l++;
			}

			j += linecnt;
        }
		wjq_free(pcc);
		GPIO_SetBits(GPIOG, GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_2| GPIO_Pin_3);
        break;

	case 16:

		break;
		
    case 24://65K真彩色		
    	GPIO_ResetBits(GPIOG, GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_2| GPIO_Pin_3);
		pcc = (u16 *)pdata;
	
        for(j=0; j<ylen;) //图片取模:横向,左高右低
        {

			res = f_read(&bmpfile, (void *)pdata, LineBytes*linecnt, &rlen);
			if(res != FR_OK)
			{
				wjq_log(LOG_DEBUG, "bmp read data err!\r\n");	
			}
			if(rlen != LineBytes*linecnt)
			{
				wjq_log(LOG_DEBUG, "bmp read data err!\r\n");
			}
			
			l = 0;
			while(l < linecnt)
			{
				k = l*LineBytes;
				
            	for(i=0; i < xlen; i++)
	            {
	            	/*3个字节1个像素，要进行对U16的转换
						rgb565
						#define BLUE         	 0x001F  
						#define GREEN         	 0x07E0
						#define RED           	 0xF800
					*/
					b = pdata[k++];
					g = pdata[k++];
					r = pdata[k++];
					
					r = ((r<<8)&0xf800);
					g = ((g<<3)&0x07e0);
					b = ((b>>3)&0x001f);
					*(pcc+i) = r+g+b;

	            }
				
				lcd->drv->flush(lcd, pcc, xlen);
				l++;
			}

			j += linecnt;
        }

		GPIO_SetBits(GPIOG, GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_2| GPIO_Pin_3);
			
        break;

	case 32:
		break;
		
    default:
        break;
    } 

	wjq_free(pdata);
	if(NumColors != 0)
	{
		wjq_free(palatte);
	}
	
	f_close(&bmpfile);
    return 0;
}
#endif
/**
 *@brief:      dev_lcd_test
 *@details:    LCD测试函数
 *@param[in]   void  
 *@param[out]  无
 *@retval:     
 */
void dev_lcd_test(void)
{
	DevLcdNode *LcdCog = NULL;
	DevLcdNode *LcdOled = NULL;
	DevLcdNode *LcdOledI2C = NULL;
	DevLcdNode *LcdTft = NULL;

	/*  打开三个设备 */
	LcdCog = dev_lcd_open("spicoglcd");
	if(LcdCog==NULL)
		wjq_log(LOG_FUN, "open cog lcd err\r\n");

	LcdOled = dev_lcd_open("vspioledlcd");
	if(LcdOled==NULL)
		wjq_log(LOG_FUN, "open oled lcd err\r\n");
	
